stm32-rs/stm32wlxx-hal/subghz/src/lib.rs
        self.write_byte_raw(opcode as u8);

        for byte in data.iter_mut() {
            *byte = self.read_byte_raw()
        }

        pwr.subghzspicr.write(|w| w.nss().set_bit());
        self.poll_not_busy();

        Ok(())
    }

    #[allow(clippy::unnecessary_wraps)]
    fn write(&self, data: &[u8]) -> Result<(), SubGhzError> {
        let dp = unsafe { pac::Peripherals::steal() };
        let pwr = &dp.PWR;
        self.poll_not_busy();

        pwr.subghzspicr.write(|w| w.nss().clear_bit());
        data.iter().for_each(|&b| self.write_byte_raw(b));
        pwr.subghzspicr.write(|w| w.nss().set_bit());

        self.poll_not_busy();
        Ok(())
    }

    fn write_byte_raw(&self, byte: u8) {
        while self.spi.sr.read().txe().bit_is_clear() {}
        unsafe { write_volatile(&self.spi.dr as *const _ as *mut u8, byte) };
        while self.spi.sr.read().rxne().bit_is_clear() {}
        unsafe { read_volatile(&self.spi.dr as *const _ as *const u8) };
    }

    fn read_byte_raw(&self) -> u8 {
        while self.spi.sr.read().txe().bit_is_clear() {}
        unsafe { write_volatile(&self.spi.dr as *const _ as *mut u8, 0xFF) };
        while self.spi.sr.read().rxne().bit_is_clear() {}
        unsafe { read_volatile(&self.spi.dr as *const _ as *const u8) }
    }

    /// Read one byte from the sub-Ghz radio.
    fn read_1(&self, opcode: OpCode) -> Result<u8, SubGhzError> {
        let mut buf: [u8; 1] = [0; 1];
        self.read(opcode, &mut buf)?;
        Ok(buf[0])
    }

    /// Read a fixed number of bytes from the sub-Ghz radio.
    fn read_n<const N: usize>(&self, opcode: OpCode) -> Result<[u8; N], SubGhzError> {
        let mut buf: [u8; N] = [0; N];
        self.read(opcode, &mut buf)?;
        Ok(buf)
    }

    // TODO: make a struct for the input value.
    pub fn set_hse_in_trim(&mut self, in_trimr: u8) -> Result<(), SubGhzError> {
        self.write_register(Register::HSEOUTTRIM, &[in_trimr])
    }

    /// Set the LoRa sync word.
    ///
    /// # Example
    ///
    /// ```no_run
    /// # let mut sg = unsafe { stm32wl_hal_subghz::SubGhz::conjure() };
    /// use stm32wl_hal_subghz::PacketType;
    ///
    /// sg.set_packet_type(PacketType::LoRa)?;
    /// sg.set_lora_sync_word(0x1234)?;
    /// # Ok::<(), stm32wl_hal_subghz::SubGhzError>(())
    /// ```
    pub fn set_lora_sync_word(&mut self, sync_word: u16) -> Result<(), SubGhzError> {
        self.write_register(Register::LSYNCH, &sync_word.to_be_bytes())
    }

    /// Set the power amplifier over current protection.
    ///
    /// # Example
    ///
    /// Maximum 60mA for LP PA mode.
    ///
    /// ```no_run
    /// # let mut sg = unsafe { stm32wl_hal_subghz::SubGhz::conjure() };
    /// use stm32wl_hal_subghz::Ocp;
    ///
    /// sg.set_pa_ocp(Ocp::Max60m)?;
    /// # Ok::<(), stm32wl_hal_subghz::SubGhzError>(())
    /// ```
    ///
    /// Maximum 60mA for HP PA mode.
    ///
    /// ```no_run
    /// # let mut sg = unsafe { stm32wl_hal_subghz::SubGhz::conjure() };
    /// use stm32wl_hal_subghz::Ocp;
    ///
    /// sg.set_pa_ocp(Ocp::Max140m)?;
    /// # Ok::<(), stm32wl_hal_subghz::SubGhzError>(())
    /// ```
    pub fn set_pa_ocp(&mut self, ocp: Ocp) -> Result<(), SubGhzError> {
        self.write_register(Register::PAOCP, &[ocp as u8])
    }

    /// Set the synchronization word registers.
    pub fn set_sync_word(&mut self, sync_word: [u8; 8]) -> Result<(), SubGhzError> {
        self.write_register(Register::GSYNC7, &sync_word)
    }
}

// 5.8.2
/// Register and buffer access commands.
impl SubGhz {
    #[allow(dead_code)]
    #[allow(clippy::unnecessary_wraps)]
    fn read_register(&mut self, register: Register) -> Result<u8, SubGhzError> {
        let dp = unsafe { pac::Peripherals::steal() };
        let pwr = &dp.PWR;
        self.poll_not_busy();

        pwr.subghzspicr.write(|w| w.nss().clear_bit());
        self.write_byte_raw(0x1D);
        let addr: u16 = register.address();
        self.write_byte_raw(((addr >> 8) & 0xFF) as u8);
        self.write_byte_raw((addr & 0xFF) as u8);
        let ret: u8 = self.read_byte_raw();
        pwr.subghzspicr.write(|w| w.nss().set_bit());

        self.poll_not_busy();
        Ok(ret)
    }

    #[allow(clippy::unnecessary_wraps)]
    fn write_register(&mut self, register: Register, data: &[u8]) -> Result<(), SubGhzError> {
        let dp = unsafe { pac::Peripherals::steal() };
        let pwr = &dp.PWR;
        self.poll_not_busy();

        pwr.subghzspicr.write(|w| w.nss().clear_bit());
        self.write_byte_raw(OpCode::WriteRegister as u8);
        register
            .address()
            .to_be_bytes()
            .iter()
            .for_each(|&b| self.write_byte_raw(b));
        data.iter().for_each(|&b| self.write_byte_raw(b));
        pwr.subghzspicr.write(|w| w.nss().set_bit());

        self.poll_not_busy();
        Ok(())
    }

    pub fn write_buffer(&mut self, offset: u8, data: &[u8]) -> Result<(), SubGhzError> {
        let dp = unsafe { pac::Peripherals::steal() };
        let pwr = &dp.PWR;
        self.poll_not_busy();

        pwr.subghzspicr.write(|w| w.nss().clear_bit());
        self.write_byte_raw(OpCode::WriteBuffer as u8);
        self.write_byte_raw(offset);
        data.iter().for_each(|&b| self.write_byte_raw(b));
        pwr.subghzspicr.write(|w| w.nss().set_bit());

        self.poll_not_busy();
        Ok(())
    }

    pub fn read_buffer(&mut self, offset: u8, buf: &mut [u8]) -> Result<Status, SubGhzError> {
        let dp = unsafe { pac::Peripherals::steal() };
        let pwr = &dp.PWR;
        self.poll_not_busy();

        pwr.subghzspicr.write(|w| w.nss().clear_bit());
        self.write_byte_raw(OpCode::WriteBuffer as u8);
        self.write_byte_raw(offset);
        let status: Status = self.read_byte_raw().into();
        buf.iter_mut().for_each(|b| *b = self.read_byte_raw());
        pwr.subghzspicr.write(|w| w.nss().set_bit());

        self.poll_not_busy();
        Ok(status)
    }
}

// 5.8.3
/// Operating mode commands.
impl SubGhz {
    // TODO: set_sleep

    /// Put the radio into standby mode.
    ///
    /// # Examples
    ///
    /// Put the radio into standby mode using the RC 13MHz clock.
    ///
    /// ```no_run
    /// # let mut sg = unsafe { stm32wl_hal_subghz::SubGhz::conjure() };
    /// use stm32wl_hal_subghz::StandbyClk;
    ///
    /// sg.set_standby(StandbyClk::Rc)?;
    /// # Ok::<(), stm32wl_hal_subghz::SubGhzError>(())
    /// ```
    ///
    /// Put the radio into standby mode using the HSE32 clock.
    ///
    /// ```no_run
    /// # let mut sg = unsafe { stm32wl_hal_subghz::SubGhz::conjure() };
    /// use stm32wl_hal_subghz::StandbyClk;
    ///
    /// sg.set_standby(StandbyClk::Hse32)?;
    /// # Ok::<(), stm32wl_hal_subghz::SubGhzError>(())
    /// ```
    pub fn set_standby(&mut self, standby_clk: StandbyClk) -> Result<(), SubGhzError> {
        self.write(&[OpCode::SetStandby as u8, standby_clk as u8])
    }

    // TODO: set_fs

    /// Set the sub-GHz radio in TX mode.
    ///
    /// # Example
    ///
    /// Transmit with no timeout.
    ///
    /// ```no_run
    /// # let mut sg = unsafe { stm32wl_hal_subghz::SubGhz::conjure() };
    /// use stm32wl_hal_subghz::Timeout;
    ///
    /// sg.set_tx(Timeout::DISABLED)?;
    /// # Ok::<(), stm32wl_hal_subghz::SubGhzError>(())
    /// ```
    pub fn set_tx(&mut self, timeout: Timeout) -> Result<(), SubGhzError> {
        let tobits: u32 = timeout.into_bits();
        self.write(&[
            crate::OpCode::SetTx as u8,
            ((tobits >> 16) & 0xFF) as u8,
            ((tobits >> 8) & 0xFF) as u8,
            (tobits & 0xFF) as u8,
        ])
    }

    /// Set the sub-GHz radio in RX mode.
    ///
    /// # Example
    ///
    /// Receive with a 1 second timeout.
    ///
    /// ```no_run
    /// # let mut sg = unsafe { stm32wl_hal_subghz::SubGhz::conjure() };
    /// use core::time::Duration;
    /// use stm32wl_hal_subghz::Timeout;
    ///
    /// sg.set_rx(Timeout::from_duration_sat(Duration::from_secs(1)))?;
    /// # Ok::<(), stm32wl_hal_subghz::SubGhzError>(())
    /// ```
    pub fn set_rx(&mut self, timeout: Timeout) -> Result<(), SubGhzError> {
        let tobits: u32 = timeout.into_bits();
        self.write(&[
            crate::OpCode::SetRx as u8,
            ((tobits >> 16) & 0xFF) as u8,
            ((tobits >> 8) & 0xFF) as u8,
            (tobits & 0xFF) as u8,
        ])
    }

    /// Allows selection of the receiver event which stops the RX timeout timer.
    ///
    /// # Example
    ///
    /// Set the RX timeout timer to stop on preamble detection.
    ///
    /// ```no_run
    /// # let mut sg = unsafe { stm32wl_hal_subghz::SubGhz::conjure() };
    /// use stm32wl_hal_subghz::RxTimeoutStop;
    ///
    /// sg.set_rx_timeout_stop(RxTimeoutStop::Preamble)?;
    /// # Ok::<(), stm32wl_hal_subghz::SubGhzError>(())
    /// ```
    pub fn set_rx_timeout_stop(
        &mut self,
        rx_timeout_stop: RxTimeoutStop,
    ) -> Result<(), SubGhzError> {
        self.write(&[
            OpCode::SetStopRxTimerOnPreamble as u8,
            rx_timeout_stop as u8,
        ])
    }

