stm32-rs/stm32wlxx-hal/subghz/src/lib.rs
    // TODO: BPSK `Set_ModulationParams`

    pub fn set_packet_params(&mut self, params: &GenericPacketParams) -> Result<(), SubGhzError> {
        self.write(params.as_slice())
    }

    // TODO: BPSK `Set_PacketParams`

    // TODO: LoRa `Set_PacketParams`

    // TODO: `Set_LoRaSymbTimeout`
}

// 5.8.5
/// Communication status and information commands
impl SubGhz {
    /// Get the radio status.
    ///
    /// The hardware appears to have many bugs where this will return reserved
    /// values.
    ///
    /// ```no_run
    /// # let mut sg = unsafe { stm32wl_hal_subghz::SubGhz::conjure() };
    /// use stm32wl_hal_subghz::Status;
    ///
    /// let status: Status = sg.status()?;
    /// # Ok::<(), stm32wl_hal_subghz::SubGhzError>(())
    /// ```
    pub fn status(&self) -> Result<Status, SubGhzError> {
        Ok(self.read_1(OpCode::GetStatus)?.into())
    }

    /// Get the RX buffer status.
    ///
    /// The return tuple is (status, payload_length, buffer_pointer).
    ///
    /// # Example
    ///
    /// ```no_run
    /// # let mut sg = unsafe { stm32wl_hal_subghz::SubGhz::conjure() };
    /// use stm32wl_hal_subghz::{CmdStatus, Timeout};
    ///
    /// sg.set_rx(Timeout::DISABLED)?;
    /// loop {
    ///     let (status, len, ptr) = sg.rx_buffer_status()?;
    ///
    ///     if status.cmd() == Ok(CmdStatus::Avaliable) {
    ///         let mut buf: [u8; 256] = [0; 256];
    ///         let data: &mut [u8] = &mut buf[..usize::from(len)];
    ///         sg.read_buffer(ptr, data)?;
    ///         // ... do things with the data
    ///         break;
    ///     }
    /// }
    /// # Ok::<(), stm32wl_hal_subghz::SubGhzError>(())
    /// ```
    pub fn rx_buffer_status(&self) -> Result<(Status, u8, u8), SubGhzError> {
        let data: [u8; 3] = self.read_n(OpCode::GetRxBufferStatus)?;
        Ok((data[0].into(), data[1], data[2]))
    }

    /// Returns information on the last received packet.
    ///
    /// # Example
    ///
    /// ```no_run
    /// # let mut sg = unsafe { stm32wl_hal_subghz::SubGhz::conjure() };
    /// use stm32wl_hal_subghz::{CmdStatus, Timeout};
    ///
    /// sg.set_rx(Timeout::DISABLED)?;
    /// loop {
    ///     let pkt_status = sg.gfsk_packet_status()?;
    ///
    ///     if pkt_status.status().cmd() == Ok(CmdStatus::Avaliable) {
    ///         let rssi = pkt_status.rssi_avg();
    ///         // ... log rssi here
    ///         break;
    ///     }
    /// }
    /// # Ok::<(), stm32wl_hal_subghz::SubGhzError>(())
    /// ```
    pub fn gfsk_packet_status(&self) -> Result<GfskPacketStatus, SubGhzError> {
        Ok(GfskPacketStatus::from(
            self.read_n(OpCode::GetPacketStatus)?,
        ))
    }

    // TODO: LoRa Get_PacketStatus

    // TODO: Get_RssiInst

    /// (G)FSK packet stats.
    ///
    /// # Example
    ///
    /// ```no_run
    /// # let mut sg = unsafe { stm32wl_hal_subghz::SubGhz::conjure() };
    /// use stm32wl_hal_subghz::{FskStats, Stats};
    ///
    /// let stats: Stats<FskStats> = sg.fsk_stats()?;
    /// // ... use stats
    /// sg.reset_stats();
    /// # Ok::<(), stm32wl_hal_subghz::SubGhzError>(())
    /// ```
    pub fn fsk_stats(&self) -> Result<Stats<FskStats>, SubGhzError> {
        let data: [u8; 7] = self.read_n(OpCode::GetStats)?;
        Ok(Stats::from_raw_fsk(data))
    }

    /// LoRa packet stats.
    ///
    /// # Example
    ///
    /// ```no_run
    /// # let mut sg = unsafe { stm32wl_hal_subghz::SubGhz::conjure() };
    /// use stm32wl_hal_subghz::{LoRaStats, Stats};
    ///
    /// let stats: Stats<LoRaStats> = sg.lora_stats()?;
    /// // ... use stats
    /// sg.reset_stats();
    /// # Ok::<(), stm32wl_hal_subghz::SubGhzError>(())
    /// ```
    pub fn lora_stats(&self) -> Result<Stats<LoRaStats>, SubGhzError> {
        let data: [u8; 7] = self.read_n(OpCode::GetStats)?;
        Ok(Stats::from_raw_lora(data))
    }

    /// Reset the stats as reported in [`lora_stats`] and [`fsk_stats`].
    ///
    /// # Example
    ///
    /// ```no_run
    /// # let mut sg = unsafe { stm32wl_hal_subghz::SubGhz::conjure() };
    ///
    /// sg.reset_stats();
    /// # Ok::<(), stm32wl_hal_subghz::SubGhzError>(())
    /// ```
    ///
    /// [`lora_stats`]: crate::SubGhz::lora_stats
    /// [`fsk_stats`]: crate::SubGhz::fsk_stats
    pub fn reset_stats(&mut self) -> Result<(), SubGhzError> {
        const RESET_STATS: [u8; 7] = [0x00; 7];
        self.write(&RESET_STATS)
    }
}

// 5.8.6
/// IRQ commands.
impl SubGhz {
    /// Set the interrupt configuration.
    ///
    /// # Example
    ///
    /// Enable TX and timeout interrupts globally.
    ///
    /// ```no_run
    /// # let mut sg = unsafe { stm32wl_hal_subghz::SubGhz::conjure() };
    /// use stm32wl_hal_subghz::{CfgDioIrq, Irq, IrqLine};
    ///
    /// const IRQ_CFG: CfgDioIrq = CfgDioIrq::new()
    ///     .irq_enable(IrqLine::Global, Irq::TxDone)
    ///     .irq_enable(IrqLine::Global, Irq::Timeout);
    /// sg.set_irq_cfg(&IRQ_CFG)?;
    /// # Ok::<(), stm32wl_hal_subghz::SubGhzError>(())
    /// ```
    pub fn set_irq_cfg(&mut self, cfg: &CfgDioIrq) -> Result<(), SubGhzError> {
        self.write(cfg.as_slice())
    }

    /// Get the IRQ status.
    ///
    /// # Example
    ///
    /// Wait for TX to complete or time out.
    ///
    /// ```no_run
    /// # let mut sg = unsafe { stm32wl_hal_subghz::SubGhz::conjure() };
    /// use stm32wl_hal_subghz::Irq;
    ///
    /// loop {
    ///     let (_, irq_status) = sg.irq_status()?;
    ///     if irq_status & Irq::TxDone.mask() != 0 {
    ///         // handle TX done
    ///         break;
    ///     }
    ///     if irq_status & Irq::Timeout.mask() != 0 {
    ///         // handle timeout
    ///         break;
    ///     }
    /// }
    /// # Ok::<(), stm32wl_hal_subghz::SubGhzError>(())
    /// ```
    pub fn irq_status(&self) -> Result<(Status, u16), SubGhzError> {
        let data: [u8; 3] = self.read_n(OpCode::GetIrqStatus)?;
        let irq_status: u16 = u16::from_be_bytes([data[1], data[2]]);
        Ok((data[0].into(), irq_status))
    }

    /// Clear the IRQ status.
    ///
    /// # Example
    ///
    /// Clear the [`TxDone`] and [`RxDone`] interrupts.
    ///
    /// ```no_run
    /// # let mut sg = unsafe { stm32wl_hal_subghz::SubGhz::conjure() };
    /// use stm32wl_hal_subghz::Irq;
    ///
    /// sg.clear_irq_status(Irq::TxDone.mask() | Irq::RxDone.mask())?;
    /// # Ok::<(), stm32wl_hal_subghz::SubGhzError>(())
    /// ```
    ///
    /// [`TxDone`]: crate::Irq::TxDone
    /// [`RxDone`]: crate::Irq::RxDone
    pub fn clear_irq_status(&mut self, mask: u16) -> Result<(), SubGhzError> {
        self.write(&[
            crate::OpCode::ClrIrqStatus as u8,
            ((mask >> 8) & 0xFF) as u8,
            (mask & 0xFF) as u8,
        ])
    }
}

